Table of Contents
 Class RebarSegment3DBase
Namespace
IdeaRS.OpenModel.Model
Assembly
IdeaRS.OpenModel.dll
Represents a segment in 3D space.
public abstract class RebarSegment3DBase : OpenObject
Inheritance
object
OpenObject
RebarSegment3DBase
Derived
RebarSegment3DArc3Pts
RebarSegment3DLine
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 EndPoint
Gets or sets the endpoint of the segment.
public RebarPoint3D EndPoint { get; set; }
Property Value
RebarPoint3D
 Edit this page